# Santa Wishlist API

Небольшой сервис на Spring Boot для управления списком подарков.

### Стек технологий:
* **Java 21**
* **Spring Boot 3.5.9** (Data JPA, Validation)
* **PostgreSQL**
* **Docker Compose**
* **Lombok**

### Как запустить:
1. Поднять базу в Docker:
   ```bash
   docker-compose up -d
2. Запустить приложение через IDE или Maven:
    ```bash
    ./mvnw spring-boot:run


## Возможности

* **Сортировка** Реализована динамическая сортировка. Можно сортировать список по любому полю сущности.  
  *Пример:* `GET /api/wishes?sortBy=priority&direction=DESC`

* **Валидация** Используется `jakarta.validation`. Если отправить пустые поля или некорректные данные в POST-запросе, приложение вернет статус **400 Bad Request** с детальным описанием ошибок.

* **Обработка ошибок** Реализован глобальный перехват исключений через `@RestControllerAdvice`. Это гарантирует, что клиент всегда получит структурированный JSON-ответ вместо стандартной ошибки Tomcat.

* **Тестовые данные** Для удобства проверки добавлен `CommandLineRunner`. При первом запуске (если база пуста) сервис автоматически создаёт 5 тестовых желаний.

